Revit 2027 API
BackgroundProcessTaskType.Equality Operator
Compares two BackgroundProcessTaskType instances.
Namespace: Autodesk.Revit.DB.BackgroundProcessTask
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator ==(
	BackgroundProcessTaskType first,
	BackgroundProcessTaskType second
)
Public Shared Operator = (
	first As BackgroundProcessTaskType,
	second As BackgroundProcessTaskType
) As Boolean
public:
static bool operator ==(
	BackgroundProcessTaskType^ first,
	BackgroundProcessTaskType^ second
)
static let inline (=)
        first : BackgroundProcessTaskType *
        second : BackgroundProcessTaskType  : bool
Parameters
first BackgroundProcessTaskType
The first BackgroundProcessTaskType.
second BackgroundProcessTaskType
The second BackgroundProcessTaskType.
Return Value
Boolean
True if the inputs are identical, false if they are different.
See Also
Reference
BackgroundProcessTaskType Class
Autodesk.Revit.DB.BackgroundProcessTask Namespace